# SetVPLrOvrdOpty

## Description
Sets the opacity for a layer override.

```pascal
PROCEDURE SetVPLrOvrdOpty(
				viewportHandle : HANDLE;
				layerHandle    : HANDLE;
				opacity        : INTEGER);
```

```python
def vs.SetVPLrOvrdOpty(viewportHandle, layerHandle, opacity):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|
|layerHandle|HANDLE|The layer handle.|
|opacity|INTEGER|Opacity (0-100)|

## See Also
VS Functions:
GetVPLrOvrdOpty

## Version
Availability: from Vectorworks 2014

## Category
* Viewports